'use strict';

(function () {
  var MAX_PINS_COUNT = 5;

  var type = document.querySelector('#type');


})();

/*
В этом задании мы научимся фильтровать данные, полученные с сервера. В проекте предусмотрена отдельная форма с различными фильтрами. Мы разберём ее чуть позже. Начнём тренировки с малого: запрограммируем фильтр по типу жилья и количеству отображаемых меток. С фильтром по типу жилья сложностей возникнуть не должно ‐ задача достаточно тривиальная.
Задача
Выводить на карту не более 5 меток. Установка фильтра по количеству должна происходить сразу после получения данных с сервера;
Запрограммировать фильтр «Тип жилья». Помните, независимо от того сколько объявлений соответствует фильтру «Тип жилья» на карте не должно отображаться больше 5 объявлений.
*/
